//PNDB101C  JOB 1,JOHNB,TIME=(1,1),NOTIFY=&SYSUID
//* Compile and link PNDB101
//* COBOL program for Cust Acct Enquiry for batch
//*
//* first clear the load library
//STEP01       EXEC PGM=IDCAMS
//SYSOUT        DD SYSOUT=*
//SYSPRINT      DD DUMMY
//SYSIN         DD *
  DELETE Z63454.PETRONET.LOAD(PNDB101)
  IF MAXCC = 8 THEN SET MAXCC = 0
/*
//* Now compile and link
//STEP02       EXEC  PROC=IGYWCL
//COBOL.SYSIN   DD  DSNAME=&SYSUID..PETRONET.COBOL(PNDB101),DISP=SHR
//COBOL.SYSLIB  DD  DSNAME=&SYSUID..PETRONET.COPYLIB,DISP=SHR
//LKED.SYSLMOD  DD  DSNAME=&SYSUID..PETRONET.LOAD(PNDB101),DISP=SHR
//SYSPRINT      DD  SYSOUT=*
/*
