//PNRE301L  JOB 1,JOHNB,TIME=(1,1),NOTIFY=&SYSUID
//*
//* Compile and link PNRE301
//* COBOL program for REtail Transaction List
//*
//* first clear the load library
//STEP01       EXEC PGM=IDCAMS
//SYSOUT        DD SYSOUT=*
//SYSPRINT      DD DUMMY
//SYSIN         DD *
  DELETE Z63454.PETRONET.LOAD(PNRE301)
  IF MAXCC = 8 THEN SET MAXCC = 0
/*
//* Now compile and link
//STEP02       EXEC  PROC=IGYWCL
//COBOL.SYSIN   DD  DSNAME=&SYSUID..PETRONET.COBOL(PNRE301),DISP=SHR
//COBOL.SYSLIB  DD  DSNAME=&SYSUID..PETRONET.COPYLIB,DISP=SHR
//LKED.SYSLMOD  DD  DSNAME=&SYSUID..PETRONET.LOAD(PNRE301),DISP=SHR
//SYSPRINT      DD  SYSOUT=*
/*
