//PNRE305R  JOB 1,JOHNB,TIME=(1,1),NOTIFY=&SYSUID
//*
//* Run Retail Transaction List for acustomer.
//* This loads a retail transaction file into the RETAIL_TRANSN_TBL.
//* COBOL program PNRE302
//*
//STEP01   EXEC  PGM=IKJEFT01
//STEPLIB      DD DSNAME=Z63454.PETRONET.LOAD,DISP=SHR
//             DD  DSNAME=DSND10.SDSNLOAD,DISP=SHR
//             DD  DSNAME=DSND10.SDSNLOD2,DISP=SHR
//RTLFILE      DD DSNAME=Z63454.PETRONET.RETAIL(RTLTRAN1),DISP=SHR
//PRTFILE      DD  SYSOUT=*
//SYSPRINT     DD  SYSOUT=*
//SYSTSPRT     DD  SYSOUT=*
//SYSTSIN      DD *,SYMBOLS=CNVTSYS
  DSN SYSTEM(DBDG)
  RUN PROGRAM(PNRE305) PLAN(&SYSUID) LIB('&SYSUID..PETRONET.LOAD')
/*
