IDENTIFICATION DIVISION.
       PROGRAM-ID.    PNDB101.
       AUTHOR.        John Braddock.
       DATE-WRITTEN.  14-Mar-2026.
      *
      * Name: Customer Account Inquiry. Report version.
      * Pgm to run a customer account enquiry report.
      * This program calls the standard customer account enquiry
      * module to provide a printed report for a customer.
      *
      * NOTE: this proram is run for cust 1234 from JCL as:
      * //pgm    EXEC PGM=PNDB101,PARM="00001234"
      *
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  ws_pgm_err_sts             PIC 9.
       01  ws_rtn_sts                 PIC 9.
       01  dat1                       PIC 9.

       01  ws_cust_no                 PIC X(08).

       COPY "CUSTQREC"
           REPLACING cust_enquiry_rec BY ws_cust_enquiry_rec.

       LINKAGE SECTION.
       01  jcl-parm.
           03  jcl-parm-length       PIC S9(4) COMP.
           03  jcl-cust-no           PIC X(8).

       PROCEDURE DIVISION USING jcl-parm.
       main.
           DISPLAY "PNDB101 Version 1.0"

           PERFORM 1000_init

           IF jcl-parm-length = SPACES
               DISPLAY "No cust supplied"
               MOVE 1 TO ws_pgm_err_sts
           ELSE
               MOVE jcl-cust-no TO cust-no OF ws_cust_acct_inq_rec
           END-IF

           IF ws_pgm_err_sts = 0
               PERFORM 2000_call_pndb905
            END-IF

           IF ws_pgm_err_sts = 0
               DISPLAY "called PNDB905"
               DISPLAY "cust_name=" cust_name OF ws_cust_acct_inq_rec
           END-IF

           STOP RUN
           .

       1000_init.
           MOVE 0    TO ws_pgm_err_sts
           .

       2000_call_pndb905.
           DISPLAY "calling PNDB905"
      *     MOVE TO ws_cust_no

           CALL "PNDB905"
               USING ws_cust_acct_inq_rec
               RETURNING ws_rtn_sts
           END-CALL

           IF ws_rtn_sts NOT = 0
               MOVE 1 TO ws_pgm_err_sts
           END-IF
           .
